In [3]:
### Importaciones ###

In [4]:

import pandas as pd
import matplotlib.pyplot as plt
import sqlite3 as sql

In [5]:
### Lector de archivo
df1 = pd.read_csv("/Users/yairmartinez/Documents/GitHub/Data_analysis_exercises/SQL_exercise/DB/Datos/application_record.csv")
df2 = pd.read_csv("/Users/yairmartinez/Documents/GitHub/Data_analysis_exercises/SQL_exercise/DB/Datos/credit_record.csv")
print( df1.shape, df2.shape)

(438557, 18) (1048575, 3)

In [6]:
### Data Reading ###

In [7]:
df1.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [8]:
df2.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [9]:
#Título de las columnas
list_of_column_names = list(df1.columns)
print('List of column names : ', 
      list_of_column_names)

List of column names :  ['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN', 'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE', 'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH', 'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE', 'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS']

In [10]:
#Título de las columnas
list_of_column_names = list(df2.columns)
print('List of column names : ', 
      list_of_column_names)

List of column names :  ['ID', 'MONTHS_BALANCE', 'STATUS']

In [11]:
### Transformar a SQL ####

In [12]:
# Conectar de SQLite
con = sql.connect('db.db') #Conector
cur = con.cursor() #Cursor

In [13]:
# Transformar de csv's a SQL
df1.to_sql('df1', con, if_exists='replace', index=False)
df2.to_sql('df2', con, if_exists='replace', index=False)

In [14]:
# Prueba de transformación tabla 1

cur.execute("SELECT * FROM df1 LIMIT 1").fetchall()

[(5008804,
  'M',
  'Y',
  'Y',
  0,
  427500.0,
  'Working',
  'Higher education',
  'Civil marriage',
  'Rented apartment',
  -12005,
  -4542,
  1,
  1,
  0,
  0,
  None,
  2.0)]

In [15]:
# Prueba de transformación tabla 1
cur.execute("SELECT * FROM df1 LIMIT 1").fetchall()

[(5008804,
  'M',
  'Y',
  'Y',
  0,
  427500.0,
  'Working',
  'Higher education',
  'Civil marriage',
  'Rented apartment',
  -12005,
  -4542,
  1,
  1,
  0,
  0,
  None,
  2.0)]

In [16]:
# Prueba de transformación tabla 2
cur.execute("SELECT * FROM df2 LIMIT 2").fetchall()

[(5001711, 0, 'X'), (5001711, -1, '0')]

In [17]:
# Cerrar SQLite
# con.commit() # Ejecutar acciones en DB
# con.close() # Cerrar DB